cask_args appdir: "~/Applications", fontdir: "~/Library/Fonts"

tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/versions"
tap "crisidev/chunkwm"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "neomutt/neomutt"
tap "neovim/neovim"
tap "osx-cross/avr"
tap "phrase/brewed"
tap "ravenac95/sudolikeaboss"
tap "universal-ctags/universal-ctags"

brew "ansible"
brew "autoconf"
brew "automake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "curl", args: ["with-openssl"]
brew "diff-so-fancy"
brew "direnv"
brew "fd"
brew "fzf"
brew "fzy"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-typist"
brew "gnupg"
brew "gnutls"
brew "gpg-agent"
brew "grep", args: ["with-default-names"]
brew "htop"
brew "httpie"
brew "hub"
brew "iftop"
brew "jq"
brew "jrnl"
brew "kubernetes-cli"
brew "less"
brew "libsodium"
brew "libuv", args: ["HEAD"]
brew "lolcat"
brew "make", args: ["with-default-names"]
brew "mas"
brew "moreutils"
brew "mosh"
brew "ncdu"
brew "ncmpcpp"
brew "ncurses"
brew "neofetch"
brew "neomutt/neomutt/neomutt", args: ["with-gpgme", "with-libidn", "with-notmuch-patch", "with-s-lang"]
brew "neovim"
brew "nmap"
brew "node"
brew "openssl"
brew "pass"
brew "phrase/brewed/phraseapp"
brew "ponysay"
brew "pv"
brew "python"
brew "python3"
brew "rsync"
brew "sl"
brew "stow"
brew "sudolikeaboss"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "unrar"
brew "universal-ctags", args: ["HEAD"]
brew "vim", args: ["with-override-system-vi"]
brew "weechat", args: ["with-curl", "with-lua", "with-perl", "with-python", "with-ruby"]
brew "wget"
brew "youtube-dl"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# cask "1password"
cask "alfred"
cask "dash"
cask "docker"
cask "firefox"
cask "gnucash"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "minikube"
cask "monolingual"
cask "slack"
cask "steam"
cask "telegram"
cask "vagrant"
cask "viber"
cask "vimr"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"

mas "Deckset", id: 847496013
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sip", id: 507257563
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
