cask_args appdir: "~/Applications", fontdir: "~/Library/Fonts"

tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"

brew "ansible"
brew "bash"
brew "bat"
brew "coreutils"
brew "curl-openssl"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "go"
brew "ripgrep"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "less"
brew "make"
brew "mas"
brew "molovo/revolver/revolver"
brew "most"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "node"
brew "openssl"
brew "python"
brew "python3"
brew "reattach-to-user-namespace"
brew "rsync"
brew "ruby"
brew "shellcheck"
brew "stow"
brew "tree"
brew "tmux"
brew "vault"
brew "weechat"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "minikube"
cask "slack"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sip", id: 507257563
mas "Telegram", id: 747648890
