cask_args appdir: "~/Applications", fontdir: "~/Library/Fonts"

tap "buo/cask-upgrade"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "molovo/revolver"
tap "mongodb/brew"
tap "neovim/neovim"
tap "txn2/tap"
tap "universal-ctags/universal-ctags"
brew "ansible"
brew "bash"
brew "bat"
brew "blueutil"
brew "python"
brew "colordiff"
brew "coreutils"
brew "curl-openssl"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glances"
brew "gnu-sed"
brew "go"
brew "helm"
brew "helm@2"
brew "hexyl"
brew "ncurses"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "kubespy"
brew "less"
brew "ruby"
brew "linkerd"
brew "make"
brew "mas"
brew "minikube", link: false
brew "minio-mc"
brew "most"
brew "neofetch"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "node"
brew "pandoc"
brew "pyenv-virtualenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "step"
brew "stern"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "vault"
brew "weechat"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "instrumenta/instrumenta/conftest"
brew "instrumenta/instrumenta/kubeval"
brew "molovo/revolver/revolver"
brew "mongodb/brew/mongodb-community-shell"
brew "txn2/tap/kubefwd"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD", "with-jansson"]
cask "1password"
cask "1password-cli"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "google-cloud-sdk"
cask "iterm2"
cask "java11"
cask "karabiner-elements"
cask "keepingyouawake"
cask "mongodb-compass"
cask "netnewswire"
cask "slack"
cask "teamspeak-client"
cask "viber"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "Wipr", id: 1320666476
